InformationRegisters/КР_ОтметкиИнтеграционныхИзменений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КР_ОтметкиИнтеграционныхИзменений</Name>
			<Comment>JIRA№ A2105505-1515</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментРегистрации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КР_ОтметкиИнтеграционныхИзменений/Ext/ManagerModule.bsl
////////////////////////////////////////////////////
//// Модуль менеджера регистра сведений "КР_ОтметкиИнтеграционныхИзменений"
//// Создан: 03.04.2023 Марченко С.Н., КРОК, JIRA№A2105505-1515
//// Оптимизация общего механизма интеграции

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция Записать(Объект, СообщениеОбмена) Экспорт 
	
	СсылкаНаОбъект = КР_ОбщегоНазначениеСервер.ПолучитьСсылкуСУчетомСсылкиНового(Объект);
	
	ОтметкиИнтеграционныхИзменений = РегистрыСведений.КР_ОтметкиИнтеграционныхИзменений;
	
	Запись = ОтметкиИнтеграционныхИзменений.СоздатьМенеджерЗаписи();
	Запись.СсылкаНаОбъект = СсылкаНаОбъект;
	
	// Сначала поищем уже существующую запись
	// Если запись существует 
	//	и момент ее регистрации соврадает, то ничего не делаем - повторная загрузку
	//	и момент времени меньше момента времени записи, 
	// 		то запись не обновляем. Формируем пояснительное вообщение с изменением статуса    
	// Иначе добавляем новую запись
	
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда   
		
		Запись.СсылкаНаОбъект = СсылкаНаОбъект;  
		Запись.КлючСообщения = СообщениеОбмена.КлючСообщения;
		Запись.МоментРегистрации = СообщениеОбмена.МоментРегистрации;
		Запись.ДатаРегистрации = СообщениеОбмена.ДатаРегистрации;
		
		Запись.Записать();
		
		Возврат Истина;
	КонецЕсли;	
	
	Если Запись.ДатаРегистрации > СообщениеОбмена.ДатаРегистрации Тогда 
		ОбъектМетаданные = Объект.Метаданные();   
		
		ТекстСообщения = НСтр("ru = 'Объект ""%1"" был изменен более поздним входящим интеграционным сообщением %2 от %3'");   
		ТекстСообщения = СтрШаблон(ТекстСообщения,
			СсылкаНаОбъект, Запись.КлючСообщения, Запись.ДатаРегистрации);
			
		// A2105505-2346
		Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.КР_Размеры") Тогда 
			ТипЗаписиВЛог = КР_ОбменRabbitОбработкаСообщенийОбмена.ТипЗаписиВЛог_Информация(ОбъектМетаданные, СсылкаНаОбъект);
			КР_ОбменRabbitОбработкаСообщенийОбмена.ДобавитьЗаписьВЛог(СообщениеОбмена, ТекстСообщения, ТипЗаписиВЛог);
		Иначе
		//	
		
		ТипЗаписиВЛог = КР_ОбменRabbitОбработкаСообщенийОбмена.ТипЗаписиВЛог_ИнформацияУстаревшиеДанные(ОбъектМетаданные, СсылкаНаОбъект);
		КР_ОбменRabbitОбработкаСообщенийОбмена.ДобавитьЗаписьВЛог(СообщениеОбмена, ТекстСообщения, ТипЗаписиВЛог);
		
		Возврат Ложь;
		
		// A2105505-2346
		КонецЕсли;
		//

	КонецЕсли;
		
	Если Запись.ДатаРегистрации = СообщениеОбмена.ДатаРегистрации Тогда 
		Возврат Истина;    	
	КонецЕсли;
	
	Запись.КлючСообщения = СообщениеОбмена.КлючСообщения;
	Запись.МоментРегистрации = СообщениеОбмена.МоментРегистрации;
	Запись.ДатаРегистрации = СообщениеОбмена.ДатаРегистрации;
	
	Запись.Записать();
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецЕсли
